of222/tutorials/rheoInterFoam/DieSwell/GiesekusLog/0/theta1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
   inlet
    {
       type            fixedValue;
       value           uniform (0 0 0 0 0 0);
    }
    
    outlet
    {
       type            zeroGradient;
    }
    
    wallIn
    {
      type             zeroGradient;
    }
    
    wallOut
    {
       type            zeroGradient;
    }
    
    atmosphere
    {
         type          zeroGradient;
    }
    
    symmetry
    {
       type            symmetryPlane;
    }
}
